package normal51;

/**
 * 2266. 统计打字方案数
 * 算术评级: 5
 * 第 292 场周赛
 * Q3
 * 同步题目状态
 * <p>
 * 1857
 * 相关标签
 * premium lock icon
 * 相关企业
 * 提示
 * Alice 在给 Bob 用手机打字。数字到字母的 对应 如下图所示。
 * <p>
 * <p>
 * <p>
 * 为了 打出 一个字母，Alice 需要 按 对应字母 i 次，i 是该字母在这个按键上所处的位置。
 * <p>
 * 比方说，为了按出字母 's' ，Alice 需要按 '7' 四次。类似的， Alice 需要按 '5' 两次得到字母  'k' 。
 * 注意，数字 '0' 和 '1' 不映射到任何字母，所以 Alice 不 使用它们。
 * 但是，由于传输的错误，Bob 没有收到 Alice 打字的字母信息，反而收到了 按键的字符串信息 。
 * <p>
 * 比方说，Alice 发出的信息为 "bob" ，Bob 将收到字符串 "2266622" 。
 * 给你一个字符串 pressedKeys ，表示 Bob 收到的字符串，请你返回 Alice 总共可能发出多少种文字信息 。
 * <p>
 * 由于答案可能很大，将它对 109 + 7 取余 后返回。
 * <p>
 * <p>
 * <p>
 * 示例 1：
 * <p>
 * 输入：pressedKeys = "22233"
 * 输出：8
 * 解释：
 * Alice 可能发出的文字信息包括：
 * "aaadd", "abdd", "badd", "cdd", "aaae", "abe", "bae" 和 "ce" 。
 * 由于总共有 8 种可能的信息，所以我们返回 8 。
 * 示例 2：
 * <p>
 * 输入：pressedKeys = "222222222222222222222222222222222222"
 * 输出：82876089
 * 解释：
 * 总共有 2082876103 种 Alice 可能发出的文字信息。
 * 由于我们需要将答案对 109 + 7 取余，所以我们返回 2082876103 % (109 + 7) = 82876089 。
 * <p>
 * <p>
 * 提示：
 * <p>
 * 1 <= pressedKeys.length <= 105
 * pressedKeys 只包含数字 '2' 到 '9' 。
 */
public class Code4 {

    public int countTexts(String pressedKeys) {
        //结果
        long sum = 0L;
        //每种字符偏移量
        int[] arr = new int[]{0, 0, 3, 3, 3, 3, 3, 4, 3, 4};
        //索引
        int index = 0;
        //循环
        while (index < pressedKeys.length()) {
            //开始、结束
            int start = index;
            int end = index;
            //如果是连续的
            while (end + 1 < pressedKeys.length() && pressedKeys.charAt(end + 1) == pressedKeys.charAt(index)) {
                //+1
                end++;
            }
            //开始字符
            int key = pressedKeys.charAt(start) - '0';
            //计算本次
            long value = count(end - start + 1, arr[key]);
            //判空
            if (sum == 0) {
                //默认
                sum = value;
            } else {
                //相乘
                sum = sum * value % 1000000007L;
            }
            //下一个
            index = end + 1;
        }
        //返回
        return (int) (sum % 1000000007L);
    }

    //计算本次
    private long count(int length, int offset) {
        //缓存
        long[] arr = new long[length + 1];
        //第一个
        arr[0] = 1;
        //循环
        for (int i = 1; i < arr.length; i++) {
            //循环2
            for (int j = i - offset; j < i; j++) {
                //如果是
                if (j >= 0) {
                    //叠加
                    arr[i] = (arr[i] % 1000000007L + arr[j]) % 1000000007L;
                }
            }
        }
        //返回
        return arr[arr.length - 1];
    }

    public static void main(String[] args) {
        //2082876103
        //System.out.println(new Code4().countTexts("222222222222222222222222222222222222"));
        System.out.println(new Code4().countTexts("88888888888888888888888888888999999999999999999999999999994444444444444444444444444444488888888888888888888888888888555555555555555555555555555556666666666666666666666666666666666666666666666666666666666222222222222222222222222222226666666666666666666666666666699999999999999999999999999999888888888888888888888888888885555555555555555555555555555577777777777777777777777777777444444444444444444444444444444444444444444444444444444444433333333333333333333333333333555555555555555555555555555556666666666666666666666666666644444444444444444444444444444999999999999999999999999999996666666666666666666666666666655555555555555555555555555555444444444444444444444444444448888888888888888888888888888855555555555555555555555555555555555555555555555555555555555555555555555555555555555999999999999999555555555555555555555555555554444444444444444444444444444444555"));
    }

}