package normal48;

/**
 * @Author ayl
 * @Date 2025-11-26
 * 2750. 将数组划分成若干好子数组的方式
 * 算术评级: 4
 * 第 351 场周赛
 * Q3
 * 同步题目状态
 * <p>
 * 1598
 * 相关标签
 * premium lock icon
 * 相关企业
 * 提示
 * 给你一个二元数组 nums 。
 * <p>
 * 如果数组中的某个子数组 恰好 只存在 一 个值为 1 的元素，则认为该子数组是一个 好子数组 。
 * <p>
 * 请你统计将数组 nums 划分成若干 好子数组 的方法数，并以整数形式返回。由于数字可能很大，返回其对 109 + 7 取余 之后的结果。
 * <p>
 * 子数组是数组中的一个连续 非空 元素序列。
 * <p>
 * <p>
 * <p>
 * 示例 1：
 * <p>
 * 输入：nums = [0,1,0,0,1]
 * 输出：3
 * 解释：存在 3 种可以将 nums 划分成若干好子数组的方式：
 * - [0,1] [0,0,1]
 * - [0,1,0] [0,1]
 * - [0,1,0,0] [1]
 * 示例 2：
 * <p>
 * 输入：nums = [0,1,0]
 * 输出：1
 * 解释：存在 1 种可以将 nums 划分成若干好子数组的方式：
 * - [0,1,0]
 * <p>
 * <p>
 * 提示：
 * <p>
 * 1 <= nums.length <= 105
 * 0 <= nums[i] <= 1
 */
public class Code8 {

    public int numberOfGoodSubarraySplits(int[] nums) {
        //结果
        long result = 1L;
        //上一个
        int last = -1;
        //循环
        for (int i = 0; i < nums.length; i++) {
            //如果是0
            if (nums[i] == 0) {
                //本轮过
                continue;
            }
            //如果没有
            if (last == -1) {
                //直接记录
                last = i;
                //本轮过
                continue;
            }
            //计算本次
            result = result * (i - last) % 1000000007L;
            //覆盖上一个索引
            last = i;
        }
        //判空
        if (last == -1) {
            //过
            return 0;
        }
        //默认
        return (int) (result);
    }

    public static void main(String[] args) {
        System.out.println(new Code8().numberOfGoodSubarraySplits(new int[]{0, 1, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 1, 1, 1, 1, 1, 1, 0, 0, 1, 1, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 1, 1, 1, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0}));
    }

}
